[
  {
    "id": "why-we-web",
    "slug": "why-we-web",
    "content": "We built the web with audacious ambitions: to wire the world, to connect every human mind, to accelerate progress. But, as we advanced, web development got tangled in complexity. What was once straightforward now feels like navigating a maze of frameworks and services, making it harder for new voices and ideas to emerge. The need to simplify is urgent. Web development shouldn't feel like a boring puzzle. It should be easy and fun. It should be scalable and observable by default. It should be realtime and collaborative. It should give anyone the autonomy to test new ideas and evolve without fear of \"breaking\". And it should just work. With AI, TypeScript, modern browsers, fast runtimes, and affordable edge infrastructure, the web is ready for a breakthrough. This is an invitation for the contrarians, the doers, the ones eager to make their mark: it’s time to cut through the clutter, to build the simpler tools we deserve. It's time to \"get site done.\"",
    "title": "Why we web",
    "excerpt": "We believe in a web that is simple, scalable, and collaborative. A web where anyone can test ideas and build without fear. Let's make that vision a reality.",
    "authorName": "Name of the Author",
    "authorEmail": "author@deco.cx",
    "publishedDate": "2024-04-10",
    "interactionCount": 0
  },
  {
    "id": "7242328454828830721",
    "slug": "7242328454828830721",
    "content": "Todo dia eu durmo feliz por saber que a minha empresa não vende vício, jogo e aposta pra pagar as contas. Boa noite!",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-09-19",
    "interactionCount": 172
  },
  {
    "id": "7242549063349354496",
    "slug": "7242549063349354496",
    "content": "Você gostaria de ir num evento com esses mentores e nesse local lindo? Pra essa não dá mais, mas fala comigo se você é pessoa desenvolvedora e está aberta a empreender no futuro. Vamos acelerar esse futuro ;)",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-09-19",
    "interactionCount": 95
  },
  {
    "id": "7244102916599431169",
    "slug": "7244102916599431169",
    "content": "These are going to be pretty crazy months. We've just had a massive distinction at deco.cx. We noticed a huge opportunity. And we believe we are well positioned as a company to deliver on it. We've built a world-class web platform, and we're now going to make it accessible to a thousand times more people thanks to AI-powered drawing tools. We are really enthusiastic about it. The team is on fire. This is going to accelerate the world. Enterprise-grade custom web software will be as easy as drawing! We're building the world's first full-range AI-native IDE. From lo-fi (drawing) to hi-fi (coding), in the same tool, for everyone. You \"write code\" by drawing in a multi-modal canvas directly integrated with AI. It works on top of ANY existing git repository. And it can deploy your code to the internet! How cool is that? You learned to draw before you learned to write. Why shouldn't it be the same for web software? This was the missing link to onboard billions of new web developers. Or web drawvelopers.",
    "title": "Do desenho ao deploy: o IDE que faltava",
    "excerpt": "Estamos construindo um IDE AI-native que vai da rabisco ao código final. Acelerar a web é permitir que bilhões criem desenhando — e publiquem com um clique.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-09-23",
    "interactionCount": 103
  },
  {
    "id": "7244450053749129216",
    "slug": "7244450053749129216",
    "content": "O começo de algo gigante para o Brasil, só podia vir de duas mulheres ousadas e comprometidas com o futuro como a Mariana Gomes e a Mari Monteiro. Primeiro programa de aceleração de startups deep tech no Brasil, pegando na veia do problema: como atrair o talento TÉCNICO Brasileiro para empreender no Brasil? Começa colocando um grupo de pessoas excepcionais numa sala e perguntando: que futuro vocês querem construir? Esse fim de semana vai ser apenas o primeiro de muitos! É o começo do maior pipeline de co-founders técnicos do Brasil. Link da matéria nos comentários.",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-09-24",
    "interactionCount": 489
  },
  {
    "id": "7246586550057136129",
    "slug": "7246586550057136129",
    "content": "Em algum momento vocês vão ouvir falar sobre esse fim de semana. Eu só digo uma coisa: nasceu, no Brasil, o disruptivo da YCombinator, e se chama \"Future Driven\". Dizer que isso é um \"disruptivo\" é ousado (e cringe), eu sei. Mas é que temos uma tecnologia de comunicação realmente única e uma capacidade de atrair talentos excepcionais, bem, excepcional. Juntando isso com nosso compromisso extraordinário com um futuro além do previsível para o Brasil, nós inventamos uma fábrica de pessoas irrazoáveis. Só quem sabe, sabe! Obrigado Mari Monteiro Mariana Gomes e Rafael Crespo por toparem esse experimento maluco. O problema agora é que \"the genie doesn't go back into the bottle!\" — problema bom!",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-09-30",
    "interactionCount": 267
  },
  {
    "id": "7246602072870010881",
    "slug": "7246602072870010881",
    "content": "Eu e Rafael Crespo fingindo que sabemos alguma coisa. Quem vê a foto até pensa! 😂",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-09-30",
    "interactionCount": 113
  },
  {
    "id": "7247949966415949825",
    "slug": "7247949966415949825",
    "content": "O meu maior propósito é convencer as pessoas que elas são capazes de fazer 1000x mais do que elas imaginam.",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-10-04",
    "interactionCount": 105
  },
  {
    "id": "7248011051064029184",
    "slug": "7248011051064029184",
    "content": "I’m happy to share that I’m starting a new position as Drawveloper @ Webdraw.ai – the World’s First AI Canvas IDE at deco.cx! Join the waitlist at https://webdraw.ai",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-10-04",
    "interactionCount": 195
  },
  {
    "id": "7248071831054684161",
    "slug": "7248071831054684161",
    "content": "Se você quer um cara foda pra seguir hoje, segue o Luis Silva. Esse é visionário. Não por acaso a CloudWalk, Inc. é uma das empresas *globais* de tech mais bem-sucedidas nascidas no Brasil.",
    "title": "Visionários existem — siga o Luis Silva",
    "excerpt": "Um elogio direto a um líder que está moldando o futuro da tech brasileira — reconhecer quem enxerga longe também é construir o ecossistema.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-10-04",
    "interactionCount": 102
  },
  {
    "id": "7252827208711331841",
    "slug": "7252827208711331841",
    "content": "For every prior paradigm shift that technology has enabled, Brazilians (and the global South) were resigned to watch from afar, wait years or months for it to arrive in our shores (who else here was privileged enough, in the 90's, to buy a Voodoo graphics card... 5 years after it was released?) and wonder, how amazing they must be, the superior beings who were not users, but CREATORS of this technology — a role decidedly out of our distant reach. Wait, watch, and wonder... No more. The world has evolved. The barriers have melted. I can walk into a store in Rio and buy a new gadget the next day it is globally launched. We can provide ultra-capable, ultra-portable laptops to students at competitive prices. The AI paradigm shift and all the races that it entails — most importantly SOFTWARE THAT BUILDS SOFTWARE — will not be a sole privilege of the global North. For the first time in history, the global South is now playing. This time, Brazilian entrepreneurs have an honest-to-god chance of competing head-to-head with the so-called \"developed world\". And they are very fucking excited about winning this round. I swear: you have no idea what's coming with this generation of Brazilian startups. I am meeting founders every day and — well, just wait... and watch!",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-10-18",
    "interactionCount": 120
  },
  {
    "id": "7255355894933151745",
    "slug": "7255355894933151745",
    "content": "MOST SOFTWARE ENGINEERS DON'T CARE ABOUT EQUITY! Which is crazy because that's the absolute fastest path for them to get rich within their 20s and 30s. So I built this long term compensation calculator to help people materialize what does it mean to meaningfully participate in building a multi-billion dollar business. I built this over a busy afternoon in between calls using https://webdraw.ai The results are amazing! This is literally pre-alpha software and I'm hooked, my email and whatsapp inbox is flooded (sorry!) because I want to webdraw all of the time and answer emails none of the time. This is gonna be fun! Join us in the waitlist, ask around and you can get an invite! https://webdraw.ai",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-10-25",
    "interactionCount": 178
  },
  {
    "id": "7258621520279654401",
    "slug": "7258621520279654401",
    "content": "A melhor parte de ser obcecado é observar quem te subestimou se decepcionar com o tempo. 🤫 Eu adoro quando conto pra alguém nosso plano de longo prazo pra acelerar a transformação do Brasil em um país protagonista em Tecnologia. A maioria das pessoas ri e acha inconsequente, talvez uns 10% arregalam os olhos e se dão conta que é possível e nós o estamos fazendo. “Resultados não precisam ser explicados. Eles apenas são.” — Werner Erhard",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-03",
    "interactionCount": 199
  },
  {
    "id": "7260078257088196608",
    "slug": "7260078257088196608",
    "content": "A medida exata da sua auto-estima é quanto você investe nas suas ferramentas e em si mesmo/a. Olha que distinção interessante. Eu sempre tive um grande orgulho de ser uma pessoa econômica e eficiente. Eu ia montar um computador, fazia uma pesquisa deep down das peças mais baratas, com melhor custo-benefício possível. Fui comprar um carro, comprei um ótimo usado. Celular? Android, óbvio! Eu nunca me permitia ter a melhor coisa. Eu associava ter a melhor coisa com extravagância: é um pecado. Pra quê ter a melhor coisa, se eu posso ter 80% do resultado com 20% do preço da melhor coisa, pegando a terceira melhor coisa? No começo desse ano, com 33 anos, pela primeira vez eu comprei *o melhor Macbook Pro disponível* com uma quantidade obscena de memória que pode rodar 700 tabs de Chrome sem suar kk. Eu já podia (financeiramente) comprar \"o melhor macbook pro disponível\" há 5, ou até 10 anos atrás. Mas eu não \"podia\". A psicologia tem um termo chamado \"self-efficacy\" (auto-eficácia) que significa a crença de que você pode depender de si mesmo e é capaz de atingir resultados e vencer problemas. Quanto mais você reconhece o seu próprio valor, mais óbvio fica investir em si mesmo pra ter as melhores ferramentas e condições para vencer os problemas. Isso vale pra todas as esferas da vida, do computador até se dar o tempo pra sua saúde e sua família. A melhor coisa que você pode fazer pelo mundo, contra-intuitivamente, é aprender a valorizar a si mesmo! Afinal, esse é o único investimento que você tem total controle sobre: suas palavras, suas ações e os seus resultados.",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-07",
    "interactionCount": 98
  },
  {
    "id": "7261153092614705153",
    "slug": "7261153092614705153",
    "content": "Se tem uma coisa que eu me arrependo AMARGAMENTE de (não) ter feito na deco.cx foi não ter começado open-source desde cedo. Eu acabei deferindo focar na extensibilidade pela comunidade porque \"o produto não estava pronto\" ou \"ainda tínhamos que focar nos clientes e provar o valor\" ou ... etc. Sempre tinha um motivo pra não parar e focar em SER EXTENSÍVEL como prioridade, como razão-de-ser. Mas a verdade é que o motivo era um lucro oculto: \"conseguimos manter o controle total\". Esse é um vício de fazedores de produto, desde designers até engenheiros, que tem a ver com a desconfiança arrogante que \"o usuário só pode piorar nossa arte\". Resultado previsível: o produto só evolui na velocidade do nosso time. Por melhor que seja o time, é uma velocidade inviável para dominar o mundo. Uma plataforma só pode maximizar o seu valor a partir do momento em que ela estabelece um feedback loop positivo: quanto mais pessoas estendendo minha plataforma, melhor a minha plataforma fica para todos. É o famoso efeito de rede: quanto mais usuários participando, melhor a rede fica para todos. Por isso quando você entra no LinkedIn ele pede seus contatos: pra te conectar com quem você conhece (retenção) e te ajudar a chamar quem ainda não veio (atração). Hoje, essa é a conversa mais importante no Webdraw. A gente tá evoluindo a passos largos e tendo discussões quentes e breakthroughs diários. Mas se tem uma coisa que eu não abro mão, que é absolutamente inviável da gente errar denovo, é isso: extensibilidade e protagonismo da comunidade é a PRIORIDADE ZERO. Nós seremos tão gigantes quanto conseguirmos chamar as pessoas para criarem o Webdraw JUNTO com a gente. E quando isso acontecer, não vai ter Github Spark, não vai ter Adobe, não vai ter Figma que nos pare. Vocês acham que Draw é só desenho? Draw também é aquilo que atrai e lidera. \"Webdraw\" é o novo centro gravitacional da digitalização, que puxa tudo pra web e te ajuda a extrair o máximo da web. Um novo paradigma pra criar e consumir a web, na velocidade insana da inteligência artificial. E nasceu no Brasil, feito por Cariocas, Paraibanos, Paulistas... Mas nunca por vira-latas. Nenhum vira-lata no time, fora a Moela, a cadela do Jose Miguel Noblecilla Inscreva-se pro beta, que vai ser histórico: https://webdraw.ai",
    "title": "Sem comunidade, plataforma não conquista o mundo",
    "excerpt": "Meu maior arrependimento: não ter priorizado open-source e extensibilidade desde cedo. Agora é prioridade zero — o Webdraw nasce para ser construído com a comunidade.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-10",
    "interactionCount": 80
  },
  {
    "id": "7261473708639219712",
    "slug": "7261473708639219712",
    "content": "Você acredita que o 🇧🇷 Brasil é mais \"eficiente\" em quantidade de desenvolvedores na economia que os 🇺🇸 Estados Unidos? Pois é, eu fui dar uma olhada nos dados de número de contas no GitHub por país (um bom proxy do numero de devs ativos naquele mercado) e tive uma grata surpresa. O Brasil é o segundo maior mercado de devs do Ocidente. Aposto que você não sabia disso! Maior que Alemanha, Reino Unido e França. Só perde pros EUA mesmo. Acontece que ... você já viu o PIB per Capita dos EUA e do Brasil? Vou te contar, o dos EUA é 7x maior. Pois é, sete vezes mais \"dinheiro por indivíduo\" rolando na sociedade. Agora junta as duas coisas e ... conclusão muito interessante: o Brasil tem uma proporção de \"desenvolvedores por PIB per Capita\" absurdamente alta. Isso significa que nós temos muito mais \"devs ativos\" na economia global do que nós \"deveríamos\" em relação a potência da nossa economia, mais do que os Americanos, Alemães, Franceses... Bom domingo, e boa sorte pra você que tá raising e conversando com VCs vira-latas que acham que o Brasil não pode produzir unicórnios em mercados globais. Não esquenta com eles! Se quiser bater um papo pra ajuda nesse processo, estamos sempre aqui pra ajudar founders. E claro, se quiser explorar dados assim também, se inscreve pro beta do Webdraw: https://webdraw.ai",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-10",
    "interactionCount": 184
  },
  {
    "id": "7261709490469683201",
    "slug": "7261709490469683201",
    "content": "Eu ODEIO quando alguém faz review de software Brasileiro e diz, estupefato, que \"bate de frente\" com ferramentas gringas. É sério? Você esperava que batesse de lado? Ou que fosse pior? Quantas décadas mais até o Brasileiro parar de ASSUMIR que o produto Brasileiro é inferior? Quantos séculos até assumir o contrário? Bom dia.",
    "title": "",
    "excerpt": "",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-11",
    "interactionCount": 454
  },
  {
    "id": "7264771955550015488",
    "slug": "7264771955550015488",
    "content": "Should I work at a Startup or Big Tech? Actually, it's not a binary choice. It's a spectrum. And it depends on some factors. - Are you willing to accept the risk that your work never materializes and you have to start over? Or you want to be sure that you will progress, year in, year out? - Are you willing to commit the majority of your time and prioritize work over other life aspects? (Specifically because you really love the CRAFT of your work and the FUTURE you are building.) Or do you think that people who work on holidays are total idiots? - Do you prefer to decide for yourself on what to work, how fast, how often to ship? Or do you prefer someone managing your workload and giving you the right amount of tasks and ensuring you're not going to burnout, and that your career is progressing? None of those are loaded questions, and I half-jokingly came up with them during this half an hour I was recording this video. Everyone is different and there are many subtleties for where to work and when. Don't take this seriously. Just make sure you're having a lot of fun, because life is short and absolutely unpredictable 👋",
    "title": "Decidindo Entre Startup e Big Tech: Risco, Dedicação e Autonomia",
    "excerpt": "Três critérios essenciais – risco, carga de trabalho e necessidade de gestão – para orientar sua escolha entre uma startup ágil e uma empresa consolidada.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-19",
    "interactionCount": 120
  },
  {
    "id": "7268098428088242176",
    "slug": "7268098428088242176",
    "content": "Viemos pra João Pessoa com o time de engenharia da deco.cx pra fazer nossa virada de Black Friday. Há 10 anos atrás, a virada de quinta pra sexta era uma LOUCURA, com uma parede de tráfego súbita. Hoje já é menos emocionante e o clima aqui tá tranquilo. Enquanto isso, já rolou um mergulho na praia (de agua quente pra quem não sabe 😁), altinha e um jantar excepcional. Se depender desse time, a tecnologia no Brasil tem um futuro brilhante. Luciano Júnior Rafael Crespo Tiago Gimenes Marcos Candeia Ígor Brasileiro Duarte Jose Miguel Noblecilla Vinicius Trindade Vitor Ribeiro Matheus Gaudencio do Rêgo Igor Arthur Guilherme Tavano Viktor Marinho Pereira Héricles Emanuel Hugo Cavalcanti Cabral Pedro França",
    "title": "Black Friday, mar morno e um time em ebulição",
    "excerpt": "Viramos a Black Friday em João Pessoa com o time de engenharia — clima tranquilo, mar quente e a certeza de que a tecnologia brasileira tem um futuro brilhante.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-29",
    "interactionCount": 534
  },
  {
    "id": "7268735735988436992",
    "slug": "7268735735988436992",
    "content": "Não existe certo e errado universal. Se você está indeciso sobre ir pra uma startup (e de qual estágio) ou pra uma empresa estabelecida, depende de muita coisa. Mas são três critérios principais, na minha opinião: - Seu apetite pra risco - Sua propensão a trabalhar mais que o \"normal\" - Sua necessidade de gerenciamento Se você tem algum(a) amigo(a) que está em dúvida, essa visualização interativa pode ajudar. Manda pra eles! Você pode brincar com esse app aqui: https://lnkd.in/d9D8tadD (clique no botão verde \"Open App\")",
    "title": "Startup vs Big Tech: Como Escolher o Melhor Caminho para sua Carreira",
    "excerpt": "Três critérios essenciais – risco, dedicação e autonomia – para decidir entre uma startup e uma empresa estabelecida.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-11-30",
    "interactionCount": 198
  },
  {
    "id": "7268974684782690304",
    "slug": "7268974684782690304",
    "content": "Nerd é nerd em qualquer lugar e qualquer momento 😂 meus nerds favoritos 💗",
    "title": "Nerds em Todo Lugar: Celebrando Nossos Favoritos",
    "excerpt": "Um post divertido que destaca a paixão pelos nerds, mostrando que a cultura nerd transcende lugares e momentos.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-01",
    "interactionCount": 151
  },
  {
    "id": "7269051353249816577",
    "slug": "7269051353249816577",
    "content": "Essas fiações expostas destroem a beleza do nosso Rio de Janeiro. Eu quero contratar um fotógrafo AI-friendly pra fazermos um projetinho. Fotos de lugares lindos, mas arruinados pela fiação. Antes e depois (removido com AI e retoques manuais). Marca aí a/o fotográfa/o carioca que curtiria esse job!",
    "title": "Desvendando a Poluição Visual: Projeto de Remoção de Fiação com IA no Rio",
    "excerpt": "Um projeto que usa IA para remover fios expostos das fotos do Rio, restaurando a beleza urbana e mostrando o potencial da tecnologia na revitalização visual.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-01",
    "interactionCount": 92
  },
  {
    "id": "7269832451676393472",
    "slug": "7269832451676393472",
    "content": "Surreal pensar que foi ainda esse ano que a gente ganhou o Pitch do Web Summit! O mais engraçado é que a gente não se preparou pra isso 😬 dá até vergonha de contar. A real é que estávamos num mês insano, com 3 eventos enormes FORA o WebSummit. No ano passado, o WS não tinha sido muito impactante pra gente (nosso público era mais enterprise/varejo) e estávamos querendo ir no WS só no dia do nosso stand, o terceiro dia de evento. Eis que... em cima da hora, sexta-feira, descobrimos que fomos chamados pra o Pitch. Só que não tínhamos mandado o deck e era na semana que vem 😂 resultado: ficamos sábado e domingo inteiro escrevendo um pitch do zero, que refletisse o momento da nossa empresa. (guerreiros de fds Luciano Júnior Rafael Crespo e Lucas Ribeiro - link do deck nos comentários) Mas pra participar, tinha que ir no primeiro dia: eram 3 fases, uma cada dia do evento. Eu fui lá, sem a menor ideia do que ia rolar. Dei o pitch. E passei pro segundo dia! Uau. Ok, voltamos no segundo dia, mas aqui provavelmente não passa, muita startup legal. E lá fomos nós, aprovados pro terceiro dia. Ok, agora eu queria ganhar 😅 então no terceiro dia fui com toda a energia. Deu certo. E essa vitória que a gente não planejou mas, dada a chance, executou com muito vigor, foi uma das melhores exposições que tivemos até hoje na vida. Toda hora alguém me manda esse ad do WebSummit 🥲 A moral da história é: abrace oportunidades malucas que aparecem. Você nunca sabe onde elas podem levar. Se você usar no máximo da sua capacidade todas as chances que aparecem, alguma delas vai te recompensar extraordinariamente. (e os outros vão dizer que foi sorte 😉)",
    "title": "Como vencemos o Pitch do Web Summit (sem planejar)",
    "excerpt": "Três dias, três fases, nenhum plano — e muita execução. Sobre abraçar oportunidades improváveis e a força de um time em ritmo máximo.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-03",
    "interactionCount": 156
  },
  {
    "id": "7270425110925234177",
    "slug": "7270425110925234177",
    "content": "Toda comunicação violenta (ou sarcástica) esconde uma pessoa frustrada com algo que ocorre como uma grande ameaça para si. Quando eu fico puto com algo que aconteceu na empresa e reajo com o meu time, eu estou meramente externalizando a frustração de me perceber falhando (e obrigando os outros a pagarem por isso). Afinal, eu só fico puto quando algo está blatantemente desalinhado do nosso futuro declarado. Mas quem colocou o nosso futuro ali, em última instância, fui eu mesmo. Quem colocou o time ali, em ultima instância, fui eu. Quem criou as conversas e os vieses de como o time opera, adivinhem.. fui eu. Então, se algo não esta funcionando… todas as setas do ppt apontam pra mim. Ocorre, dentro da minha cabeça, como uma ameaça à minha identidade de líder, de empreendedor e de desenvolvedor de produto. A “solução” contra-intuitiva pra escapar dessa armadilha, eu descobri, é: ACEITAR A POSSIBILIDADE DE FALHAR. Ou seja, ao ver algo quebrado, ao invés de achar inadmissível e proibido (eu falhar), achar curioso e instigante: “uau! Com esse time maravilhoso e meus melhores esforços, eu falhei. Vamos descobrir por que…” Pronto, já gera uma liberdade imensa pra lidar com o que não está funcionando de forma pragmática e não abduzir ninguém. No final, é tudo ego. Reação violenta sempre é o ego se defendendo. A verdadeira liberdade, que gera serenidade e empatia, é aceitar de coração cheio: eu sou um idiota, eu falho e vou falhar. Todo mundo está dando o seu melhor, inclusive eu. Agora vamos trabalhar. PS: apesar de ter clareza dessa distinção, isso está longe de querer dizer que eu seja imune à abduzir de vez em quando… como bem sabe meu time 🥲 🙏",
    "title": "Por Que Não Priorizei Open‑Source e Como Isso Quase Custou o Webdraw",
    "excerpt": "Meu maior arrependimento: não ter aberto o Webdraw antes. Agora, open‑source e extensibilidade são prioridades máximas.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-05",
    "interactionCount": 94
  },
  {
    "id": "7271200698954862592",
    "slug": "7271200698954862592",
    "content": "Founders LATAM que estão levantando capital com VC's institucionais (pre-Seed, Seed e Series A): nós queremos te ajudar! Da uma olhada no Pitch Draw. É um convite aberto pra um encontro semanal onde eu, Rafael Crespo, Luciano Júnior, Jose Miguel Noblecilla e Bruno Kuntz damos conselhos baseado nas porradas que já tomamos fazendo pitch deck. Link pra se inscrever aqui nos comentários!",
    "title": "A Jornada de 3 Dias no Pitch do Web Summit Sem Planejamento",
    "excerpt": "Como três dias intensos, sem plano prévio, levaram a um pitch vencedor no Web Summit, mostrando a força da execução rápida.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-07",
    "interactionCount": 120
  },
  {
    "id": "7273405031800848386",
    "slug": "7273405031800848386",
    "content": "70 anos atrasados. Enquanto o Elon Musk está criando uma cidade chamada “Starbase, Texas”, o Brasil vende a mesma quantidade de veículos que os Estados Unidos vendiam na década de 50. Você devia empreender em qualquer coisa que você se interessa. Pensa assim: tem 70 anos de crescimento pra executar, agora. Tem simplesmente muita coisa atrasada e ineficiente. Vamos acelerar!",
    "title": "Como a Black Friday de João Pessoa Transformou Nosso Time de Engenharia",
    "excerpt": "Relato da primeira Black Friday em João Pessoa, clima de mar morno e a energia de um time em alta performance.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-13",
    "interactionCount": 179
  },
  {
    "id": "7275661991506042882",
    "slug": "7275661991506042882",
    "content": "Today we hosted our first \"Draw in\" event — obviously, in our hometown — Draw in Rio, at the amazing Instituto 12 space in the heart of Leblon. Thank you very much for everyone that attended! We were _genuinely_ surprised with the amazing AI apps that you have created. If you didn't manage to come, don't worry! Our next event, Draw in Sampa, will be announced very soon. Please comment here if you'd like to reserve your spot! Immense praise to Maria Cecilia Marques and Giulia L. who pulled this event out of thin air in about 2 weeks — full with sponsorship and crowded with amazing people. You girls rock! I can't wait to announce our big AI event... 🤫 And as usual, you can take a look at all of the published apps in our community: https://lnkd.in/d889Fgjd",
    "title": "Draw in Rio: Our First Community AI‑Apps Meetup",
    "excerpt": "Recap of the inaugural “Draw in Rio” event at Instituto 12, celebrating AI‑app creators and announcing the upcoming Draw in Sampa gathering.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-20",
    "interactionCount": 80
  },
  {
    "id": "7277628600311271424",
    "slug": "7277628600311271424",
    "content": "Isso é bizarro mas é real oficial: paramos de contratar devs junior e estamos focando exclusivamente em designers junior. Para codar produtos. O motivo é simples: o designer sabe fazer algo lindo e bem pensado a nivel de usabilidade, e o webdraw.com ja sabe codar por ele. O contrário não é verdade. Nunca achei que eu ia passar de ser um recrutador de dev pra ser um recrutador de designer. Brave new world!",
    "title": "Recrutamento de Designers Juniors: A Nova Estratégia da Deco — Codificar com Criatividade",
    "excerpt": "Como a deco.cx está focando em designers junior para transformar ideias em código, invertendo a lógica tradicional de contratação.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-25",
    "interactionCount": 191
  },
  {
    "id": "7277769968857829376",
    "slug": "7277769968857829376",
    "content": "What a great year! I wanted to recap 2024 at deco.cx and share what we've built, what we've discovered, and where we're going now. If you were a part of this year in any way, shape or form, I want to thank you very much and promise you that 2025 will be even better! We have some amazing things cooking for both deco.cx and webdraw.com... and in 2025 we'll be shipping even faster!!",
    "title": "Recap de 2024: Conquistas, Lições e Planos Ambiciosos para 2025 na deco — Um Ano de Transformação",
    "excerpt": "Um resumo dos marcos e aprendizados da deco.cx em 2024, com foco nas metas e projetos que impulsionarão o próximo ano.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-25",
    "interactionCount": 97
  },
  {
    "id": "7278207973011652608",
    "slug": "7278207973011652608",
    "content": "Eu acho que não preciso mais postar aqui no Linkedin. Eu fiz uma AI que corretamente prevê os comentários ultra-polarizados (e caricatos) que eu vou receber de cada um dos lados. É perfeito. Eu botei o meu post sobre 70 anos atrasados e batata: a esquerda reclamou que não devia ter carro, devia ter transporte público! (O que é muito bem intencionado, etc, mas misses the point... os países ricos têm os dois.) E aí vocês também querem um gerador de comentário polarizado? Pode poupar o esforço de postar, ou também pode ser usado pra gerar um comentário pra você. Só escolher o seu lado, copiar, colar, e ser feliz!",
    "title": "AI que Prediz Comentários Polarizados: Automatizando o Engajamento no LinkedIn",
    "excerpt": "Uma IA que gera respostas polarizadas para posts, ajudando a antecipar e gerenciar debates intensos nas redes sociais.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2024-12-27",
    "interactionCount": 126
  },
  {
    "id": "7283604994426085376",
    "slug": "7283604994426085376",
    "content": "Eu adoro ser subestimado. É meu maior combustível. Eu me pergunto o que aconteceu na minha infância ou adolescência que gerou essa história em mim. Talvez tenha a ver com eu ter um irmão 9 anos mais velho, e acabei sempre tendo amigos mais velhos e sendo “o pirralho”, que não conseguia fazer as mesmas coisas que o restante do grupo. São duas partes: o se sentir subestimado (que acontece em mim, não na fala do outro) e o desejo fervoroso de “vingança”: entregar resultados (que é útil por que motiva a ação). Dito isso… resultados não precisam ser explicados. Muita gente não acreditou em mim (e no Rafael Crespo e no Luciano Júnior) quando começamos a deco.cx em 2022. De lá pra cá a empresa já foi avaliada na casa de centena de milhões de reais e atende, em absoluto, as maiores marcas de varejo e moda no Brasil, servindo Bilhões (com B) de requests por mês. Nós viemos do nada e voltaremos para o nada. Mas, antes disso, eu prometo: os próximos anos vão ser alucinantes. Sinta-se livre pra nos subestimar. Eu adoro! 🤣",
    "title": "Ser Subestimado é Meu Combustível: Como Transformar Desafios em Resultados Extraordinários",
    "excerpt": "Descubro como a vontade de provar os críticos me impulsiona a entregar resultados que elevam a deco.cx ao patamar de centenas de milhões.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-01-10",
    "interactionCount": 145
  },
  {
    "id": "7283833072624558080",
    "slug": "7283833072624558080",
    "content": "Por que eu nunca irei morar em São Paulo Muitas vezes nosso futuro é limitado por algo do passado. A nossa tendência natural, humana, é achar que o futuro é uma repetição, ou uma progressão linear, do passado. Portanto, é previsível o que pode e não pode acontecer em X tempo. Eu não preciso explicar pra vocês que isso está longe da verdade, e que todo futuro que vale a pena fazer *por definição* não é uma adjacência do passado, mas sim um salto extraordinário. Pois bem, quando você tem clareza do jogo que você está jogando (qual salto extraordinário você está comprometido em ser causa), é muito mais fácil entender \"o que vale\" e \"o que não vale\" como sucesso pra esse jogo. Um dos aspectos mais importantes de se estabelecer ao declarar o futuro são, justamente, as suas \"Condições de Satisfação\". Diferente das limitações do passado, essas são limitações que você *escolheu* pro seu futuro, por que sem elas o seu futuro não estaria completo. Se você atingir os resultados e métricas que declarou mas tiver que abrir mão dessas condições, você não estará completamente realizado. Logo, essa condição de satisfação se transforma em uma \"Condição do Jogo\" para você. Acontece que eu escolhi jogar o jogo \"Brasil é Protagonista em Tecnologia\", com minor 😅 em o \"Rio de Janeiro é um Polo Global de AI\". Para jogar esse jogo, existem concessões que fariam perder sentido o jogo. Eu pegar mala e cuia e morar em São Paulo, por exemplo, é uma delas. Eu não estou comprometido com o meu sucesso *a qualquer custo*. Se eu não puder atingir o MEU sucesso *enquanto* eu posiciono o Rio de Janeiro, esse sucesso terá sido vazio. Pode ser que um dia eu tenha que me mudar *momentaneamente* pra fora (e.g. NY), dado a natureza global do Webdraw? É possível e estou pronto pra isso. Mas eu acho que, sempre que eu estiver morando no Brasil, não faz sentido eu estar \"apostando\" em outro ecossistema que não o meu, o Carioca. Então, Paulistas, eu adoro a cidade de vocês pra passear, tem muita coisa boa, mas... eu tenho um compromisso extraordinário com a minha cidade, e ela precisa muito de mais pessoas votando nela. Eu distingui esse texto depois de almoçar com o Rafael Duton essa semana. É um privilégio e um orgulho ter pessoas como ele também apostando na nossa cidade. Me dá ainda mais forças pra continuar, apesar de tanta gente descrente no nosso futuro. E tudo me leva a crer que temos uma oportunidade dourada para acelerar nessa década. Rio: The Global AI Hub.",
    "title": "Por que Prefiro o Rio ao São Paulo: Compromisso com a Tecnologia Carioca",
    "excerpt": "Explico por que escolher viver no Rio e apoiar o ecossistema local supera a ideia de mudar para São Paulo, alinhando meus valores e metas de longo prazo.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-01-11",
    "interactionCount": 272
  },
  {
    "id": "7286754365925707776",
    "slug": "7286754365925707776",
    "content": "PARA TUDO! Olha esse serviço que genial: leavemealone.com. Você conecta sua conta de email e ele acha as mailing lists pra você unsubscribe com um click 😭 onde isso esteve toda a minha vida???",
    "title": "Ferramenta Leavemealone.com: Desinscreva-se de Mailing Lists com Um Clique",
    "excerpt": "Descubra como o Leavemealone.com permite cancelar inscrições de newsletters em segundos, simplificando sua caixa de entrada.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-01-19",
    "interactionCount": 284
  },
  {
    "id": "7291115540717228032",
    "slug": "7291115540717228032",
    "content": "AI is eating UI, and it's about to change everything we know about technology. In the next 5 years, visible interfaces will disappear completely. Here's why: Think about how you use apps today - buttons, menus, screens. Your brain has to adapt to each app's unique way of working. But what if technology adapted to YOU instead? That's the revolution happening right now. Instead of learning computer language, computers are learning to speak human. Just like electricity - you don't interface with it, you just flip a switch and it works. That's where AI is taking all software. As someone who's built frontend systems for a decade, I can tell you: The obsession with perfect UI design will become irrelevant. We're moving from interface design to invisible interaction. Natural language will become the only interface you need: • No more complex menus • No more button hunting • No more learning curves Just tell the computer what you want, in your own words. This shift democratizes technology creation in ways we've never seen: • Anyone can build software • Technical barriers dissolve • Creation becomes pure imagination At Webdraw, we're already seeing this future unfold: People with zero coding experience are building complex web applications just by describing their vision. But here's what excites me most: This levels the playing field globally. When UI becomes AI-driven, emerging markets like Brazil can leapfrog traditional tech hubs overnight. Technical expertise becomes secondary to vision and creativity. Clear communication becomes the new superpower. The winners will be those who: • Make technology invisible • Create natural experiences • Solve real human problems We're entering an era of true technological democracy where: • Creation is accessible to everyone • Technical barriers fall away • Pure imagination takes center stage Experience this future today at https://webdraw.com - where we're making technology invisible and creation limitless. Follow me for more insights on the future of technology and Brazil's tech revolution.",
    "title": "A Revolução da IA na Criação de Conteúdo: O Futuro dos Agentes Autônomos",
    "excerpt": "Como agentes de IA estão transformando a produção de conteúdo, reduzindo a necessidade de UI e permitindo interações mais naturais.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-01-31",
    "interactionCount": 82
  },
  {
    "id": "7297576399664504832",
    "slug": "7297576399664504832",
    "content": "Chegou a hora dessa gente bronzeada mostrar seu valor VOTANDO NO NOSSO PRODUCT HUNT! Webdraw product of the day!!! Sério, seu voto faz toda a diferença. E o voto do seu papagaio, do seu cachorro e da sua lontra de estimação também. Se você gosta de TECNOLOGIA BRASILEIRA, agora é a hora de pegar o LINK nos COMENTÁRIOS e mandar pra todo mundo 😇😇😇",
    "title": "Desmistificando a IA Generativa: O Que Realmente Importa",
    "excerpt": "Uma reflexão sobre como a IA generativa está mudando a forma de criar conteúdo e como focar no valor real ao invés de hype.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-02-18",
    "interactionCount": 80
  },
  {
    "id": "7297578251969785856",
    "slug": "7297578251969785856",
    "content": "Webdraw is the best place to find and make AI Apps! We’re launching on Product Hunt today. Link in comments!",
    "title": "Webdraw no Product Hunt: Como Conquistar Votos e Engajamento",
    "excerpt": "Estratégias e humor para impulsionar o Webdraw no Product Hunt, incluindo a participação de pets e a comunidade tech brasileira.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-02-18",
    "interactionCount": 203
  },
  {
    "id": "7297729453160382464",
    "slug": "7297729453160382464",
    "content": "Aqui é Brasil! Ayrton Senna! Vota vota vota no comentario!",
    "title": "Como Conversar com os Maiores Fundos de Investimento em Nova York",
    "excerpt": "Relato da semana em NY, onde o autor aprendeu a ouvir investidores sem se colocar como importante, reforçando a importância da humildade para aprender.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-02-18",
    "interactionCount": 123
  },
  {
    "id": "7298715701681258496",
    "slug": "7298715701681258496",
    "content": "Eu tenho pena de quem vive achando que é muito importante. É uma grande desvantagem que eu carreguei por muito tempo. Se você se leva muito a sério, você perde a capacidade de estar disponível pra aprender coisas simples que contrariam sua importância. Eu passei a semana em NY falando com (metade d)os maiores fundos do mundo. Os investidores mais inteligentes ouvem com total compromisso, sem querer ser importante. Só querendo descobrir o que tem pra descobrir nesse papo. E quanto menos importância eu me dou na conversa, mais eu consigo autenticamente aprender com as opiniões e perguntas deles. Eu ja me reinventei umas três vezes essa semana, a cada vez jogando pela janela coisas que, se eu fosse importante, ia querer defender com unhas e dentes. Graças a Deus eu não sou muito importante! O importante é construir a maior consumer AI network do planeta. Se achar importante é ser definido pelo seu passado, o que é uma pobreza, dado que ele é limitado. Eu sou definido pelo meu futuro. E ele é infinito em possibilidades.",
    "title": "Insights sobre IA Generativa: Tendências e Aplicações em 2025",
    "excerpt": "Exploramos as principais tendências de IA generativa em 2025, destacando casos de uso inovadores e como as empresas podem alavancar essas tecnologias.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-02-21",
    "interactionCount": 409
  },
  {
    "id": "7306339969256579072",
    "slug": "7306339969256579072",
    "content": "Hoje eu vou dar aula na Pontifícia Universidade Católica do Rio de Janeiro pela primeira vez na vida, graças ao carinhoso convite do excelente Hélio Côrtes Vieira Lopes. Muito obrigado! Nós vamos lecionar esse semestre o curso “Gerando Startups por AI”, uma mistura de Liderança e Comunicação em Alto Desempenho com Inteligência Artifical Aplicada e 22 Laws of Category Design. O objetivo vai ser que todos os alunos façam o seu primeiro real online, vendendo algo com AI. Nós vamos mostrar que AI cria novas possibilidades de empreender e gerar valor. E vamos criar o ferramental para que os alunos participem dessa revolução. Anexei aqui o formato do curso e uma palhinha da aula 1 e eu quero saber: se eu desse esse curso online, você participaria?",
    "title": "Primeira Aula na PUC‑Rio: Gerando Startups com IA",
    "excerpt": "Compartilho a experiência de lecionar o curso “Gerando Startups por IA”, combinando liderança, comunicação de alto desempenho e IA aplicada para impulsionar novos empreendedores.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-03-14",
    "interactionCount": 199
  },
  {
    "id": "7307214987318517760",
    "slug": "7307214987318517760",
    "content": "A partir de agora, software é conteúdo. Pode demorar mais um ano ou dois, mas eu suspeito que escrever código realmente vai ser tão desejável quanto escrever assembly. Por outro lado, software não precisa mais ser exaustivamente explícito em todos os detalhes. Com inteligência sendo uma commodity, qualquer um pode empacotar seu conhecimento em uma AI em termos de linguagem natural e escalar seu próprio trabalho. O novo software (conteudo) que será escrito daqui pra frente, eu acredito, será em maioria um conjunto de instruções, ferramentas e limites para agentes. Nós iremos deixar de *fazer trabalho digital* (e.g. ir na plataforma configurar ads, ou entrar no site e comprar algo) e iremos ensinar e comandar agentes que fazem esse trabalho por nós. Nesse novo mundo, o nome do jogo é: como ensino meus agentes, como dou contexto para eles e, principalmente, como eles vão alocar meu capital. Todos os setores e individuos de uma empresa tem determinado budget pra cumprir suas tarefas. Com agentes não vai ser diferente. Essa é a nossa tarefa: ajudar a recrutar e construir os agentes que a empresa precisa, centralizar o controle e contexto deles num workspace unificado com acesso seguro às fontes de dados que eles precisam para fazer *trabalho de verdade*. Mais notícias em breve 💬",
    "title": "Software as Content: Teaching AI Agents to Do Real Work",
    "excerpt": "Why the future of software is about giving instructions to AI agents, not writing explicit code, and how we’re enabling that shift.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-03-17",
    "interactionCount": 126
  },
  {
    "id": "7308845710781681665",
    "slug": "7308845710781681665",
    "content": "\"Rapaz, no mundo novo você não tem que planejar a UI de email, o Agente tem acesso a ferramenta de mandar email e você pede pra mandar. Acabou!\" E com essa frase o Marcos Candeia pivotou nossa empresa inteirinha na semana passada. Va lá, não é exatamente preciso isso, mas é quase. A gente tava muito aficcionado nos \"AI Apps\", que são fantásticos, de fato. Mas depois que pulamos na piscina dos Agentes com acesso a MCPs — integrando com qualquer fonte de dados como Google Drive, bancos, ERPs, plataformas de ecommerce... Não tem como desver. O novo mundo vai ser construído em termos de Agentes que nós educamos a fazer determinados trabalhos, conectamos com dados e alocamos capital para executar as tarefas necessárias. O novo jogo é sobre a *colaboração* entre humanos e Agentes. Agentes vão fazer de tudo, desde escrever código até propor copy até criar planilhas sofisticadas até fazer análise de dados... realmente, não tem fim. Nesse novo mundo, vão ter Agentes especialistas maravilhosos, e você vai poder \"contratar eles\" por aqui. Mas também vai poder FAZER seus próprios agentes, usando uma simples interface de chat, conectado com todos os seus dados. Quanto mais usamos os agentes, mais a gente fica impressionado. Estou muito feliz com a demanda absurda que surgiu assim que fizemos esse anúncio. Mas com a humildade que estamos apenas tateando um novo universo. Vai ser muito divertido construí-lo junto com vocês!",
    "title": "The New Era of AI Agents: No UI Needed to Send Emails",
    "excerpt": "How AI agents can now send emails directly without building UI, showcasing the shift to agent‑first workflows.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-03-21",
    "interactionCount": 115
  },
  {
    "id": "7310984842827997184",
    "slug": "7310984842827997184",
    "content": "O pessimista tem o trabalho mais fácil: ele só precisa “esperar dar errado”. Ou seja: dado algo que NÃO vai acontecer previsivelmente, o pessimista FAZ NADA e espera não acontecer. Quando não acontece, ele promulga vitorioso: “Viu? Deu errado!” e volta vagarosamente pra sua caverna deprimente. A melhor definição de Liderança que eu conheço é: realizar algo que não ia acontecer previsivelmente. Então, o contrário de pessimista não é o “otimista”, que “espera que as coisas vão dar certo”. O contrário de pessimista é LÍDER, por que *SE TORNA CAUSA* de acontecer algo que não iria acontecer previsivelmente. Ele FAZ aquilo que é necessário para que ACONTEÇA algo que não é previsível. Veja bem: ele CONCORDA com o pessimista. O pessimista está certo! Nada vai mudar se ninguém fizer nada. Mas o Líder se propõe a correr o risco, a gastar a energia, a se expor à possibilidade de fracasso (que é altamente provavel, dado que não é previsivel). No curto prazo, o pessimista ganha muito mais vezes e parece um cara muito mais inteligente e safo. Afinal, é dificil mesmo fazer acontecer o imprevisível. Entretanto, no longo prazo, os efeitos compostos são avassaladores porque, a cada pequena vitória, o lider mudou a realidade e o pessimista apenas se submeteu a ela. Você decide qual resultado você quer: você vai ser responsável pelo mecanismo mental que empregar no dia a dia. Pessimismo ou Liderança. Vai dar errado ou “vou fazer dar certo”. Boa sorte na escolha!",
    "title": "Pessimism vs Leadership: Choosing to Make the Unpredictable Happen",
    "excerpt": "A contrast between the easy path of pessimism and the proactive role of leadership in driving unpredictable outcomes.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-03-27",
    "interactionCount": 95
  },
  {
    "id": "7311472972395913217",
    "slug": "7311472972395913217",
    "content": "Hoje me mandaram essa carta de 1958 sobre \"Como achar o seu propósito\" e eu ARREPIEI, porque eu estava exatamente trabalhando num quadrante de \"Zone of Genius\" vs \"Comfort Zone/Growth Zone\". E a carta fala de ABILITIES AND DESIRES. Leia que vale a pena, aqui traduzi em português: https://lnkd.in/dqbMiPmF É interessante como a mesma distinção acontece em 1958 e em 2025 em duas cabeças diferentes. Isso me reforça algo que, a esse ponto, me parece óbvio: os seres humanos são fundamentalmente diferentes — mas iguais. Lidam com as mesmas experiências, seja na Grécia Antiga ou em uma espaço-nave pra Marte. De toda forma, concordo com a carta. O melhor modelo que eu encontrei até agora é esse. Encontrar a sua melhor expressão de si, para suas habilidades, e para aquilo que tem sentido, ou seja, que não é previsível de acontecer mas você se sente compelido a fazer acontecer. Habitando esse espaço, faça chuva faça sol, você terá uma vida que \"vale a pena\". Post original da carta: https://lnkd.in/dVGJtyvx",
    "title": "Timeless Wisdom: 1958 Letter on Purpose Still Resonates in 2025",
    "excerpt": "A translation of a 1958 letter about finding purpose, showing how timeless principles guide modern creators.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-03-28",
    "interactionCount": 156
  },
  {
    "id": "7317745968693542914",
    "slug": "7317745968693542914",
    "content": "Sabe como dizem que, pra morar fora, você tem que ficar pelo menos dois anos, pra pegar um ciclo todo? Empreender é mais ou menos a mesma coisa. Estamos no meio do terceiro ano e já saimos do vamos morrer pro vamos porrar pro vamos morrer… a parte que eu to apreciando é que você vai ficando acostumado. Aí a montanha russa realmente deixa de ser aterrorizante e passa a ser uma diversão. Você desapega do pavor e da euforia, porque sabe que elas são transitórias.",
    "title": "Entrepreneurship Abroad: From Fear to Fun",
    "excerpt": "Reflecting on the roller‑coaster of building a startup overseas, learning to embrace uncertainty and enjoy the journey.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-04-15",
    "interactionCount": 95
  },
  {
    "id": "7318024006538821632",
    "slug": "7318024006538821632",
    "content": "A nova família do GPT-4.1 está EXTRAORDINÁRIA... e só dá pra usar pela API 😵‍💫 Mas se você quiser usar HOJE mesmo assim, sem ter que descobrir como codar, é só entrar no https://deco.chat. Já temos o GPT-4.1, GPT-4.1.mini e o GPT-4.1.nano — além de todos os outros melhores modelos do mercado, como Claude, Google Gemini, Grok... e muitos mais por vir. Não precisa pedir licença pro seu dev, na deco você pode criar agentes de AI sozinho, direto no chat. Experimenta e me diz o que você achou! Marca aqui a sua amiga ou amigo que queria usar o 4.1 e não conseguiu 👇",
    "title": "Introducing GPT‑4.1 Models on deco.chat",
    "excerpt": "Announcing the new GPT‑4.1, GPT‑4.1.mini and GPT‑4.1.nano models available via API and instantly via deco.chat.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-04-15",
    "interactionCount": 88
  },
  {
    "id": "7320565301945819136",
    "slug": "7320565301945819136",
    "content": "\"Se fosse fácil, qualquer idiota faria\". O Rafael Crespo caiu na gargalhada quando eu falei isso hoje, por que é uma verdade simples. Fazer uma empresa de 1 bilhão de dólares requer você \"alinhar estrelas e manter elas alinhadas.\" Achar estrelas pra alinhar já é difícil. Manter elas alinhadas continuamente, através dos ups and downs, é mais ainda. Mas é exatamente isso que separa os times (e indivíduos) campeões dos que fracassam: os campeões não desistem no meio e sobrevivem às mais diversas tribulações, até eventualmente encontrar o sucesso (o famoso 10-year-long overnight-success). Eu fiquei 9 anos na VTEX alinhado à visão do Geraldo Thomaz e do Mariano Gomide de Faria - VTEX. Muitas pessoas estavam lá ao mesmo tempo que eu, mas desistiram, por quaisquer motivos (sem julgamento!). Eu, tendo sobrevivido a diversas crises que tivemos, como todas as startups têm, tive o privilégio de colher os louros: fui sócio num IPO em NYSE, uma das 34 empresas Brasileiras com capital aberto lá (um número muito pequeno). \"The night is darkest before the dawn.\" O ser humano nunca faz com disciplina e consistência algo que ele não decida interpretar como divertido e gratificante. Só pode colher os louros do longo prazo quem se diverte e se realiza sobrevivendo aos percalços do curto prazo. *O importante é achar a tribo de pessoas com quem você quer sobreviver a percalços juntos por um longo período de tempo!* Depois que você achar, confia no processo. Coisas grandes demoram!",
    "title": "From Startup Struggles to NYSE IPO: Lessons in Persistence",
    "excerpt": "A reflection on surviving crises, learning from VTEX, and achieving a NYSE IPO, highlighting the power of perseverance and long‑term vision.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-04-22",
    "interactionCount": 133
  },
  {
    "id": "7326946914954821632",
    "slug": "7326946914954821632",
    "content": "Ok! Nunca vi tanta Capivara no Linkedin! Já que todo mundo quer ver, vou abrir aqui de uma vez. Nosso proposito é simples. Sua empresa inteira vai adotar AI. Mais cedo ou mais tarde, de forma organizada ou caótica. Nós aceleramos a transformação de empresas e organizações em AI-first. Desde automação de processos internos construindo agentes via chat, plugando esses agentes no seu Slack ou WhatsApp Business, ou embedando nossa plataforma inteirinha White-Label no seu produto… a gente vai te ajudar a acelerar! Chama a gente pra um papo: Rafael Crespo Bruna Bueno Maria Cecilia Marques Leandro Borges",
    "title": "Capivara on LinkedIn: Accelerating AI Adoption for Enterprises",
    "excerpt": "We’re helping companies become AI‑first by offering white‑label agents, Slack/WhatsApp integration, and rapid AI transformation.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-05-10",
    "interactionCount": 136
  },
  {
    "id": "7338514198416482304",
    "slug": "7338514198416482304",
    "content": "Eu diria que 95% da minha energia vem da vontade de provar errado quem duvidou da minha capacidade. Curiosamente, meu compromisso de longo prazo com o Brasil TAMBÉM é informado pelo mesmo mecanismo: quando eu morei la fora, todos os gringos duvidavam do potencial do Brasil. Essa década, nós vamos mostrar pra eles quem faz software. O Grande Salto Tecnológico está chegando pelo Sul Global. Os cara não vão nem ver a placa.",
    "title": "Proving Doubters Wrong: Brazil's Tech Surge",
    "excerpt": "A rallying call to showcase Brazil's software talent and drive the next decade of technological breakthroughs.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-06-11",
    "interactionCount": 140
  },
  {
    "id": "7341940138718994433",
    "slug": "7341940138718994433",
    "content": "Mais uma semana maravilhosa chega ao fim, e na deco a gente sempre tem a reunião de Week End das 16:30 às 18:00 da sexta. É, sem dúvida, meu momento favorito da semana. A estrutura é assim: Primeiro, temos os Announcements. > 5 minutes — What is relevant for everyone in the company to know? Depois, vamos pro Conversation Cleanup. > 15 minutes — This week, what did you discover was taking away your power in the company? What realization you had to regain high performance and be complete with us? What breakthrough you would like to share that can help others in the company? Então, falamos dos Milestones, focando em Resultados e Aprendizados. > 60 minutes — Time to share what went right (our highlights/results), what went wrong (our learnings) and let's showcase our improvements towards our commitments (DEMO TIME!) Finalmente, chega a parte MAIS IMPORTANTE! Recognition and thanks. > 10 minutes — Recognize or thank your peers for something you admired. Aqui é onde realmente aparece como a empresa está vibrando. Essa foi uma semana com feriado no meio, parte do time OOO, e mesmo assim teve um canavial de progresso e a típica enxurrada de reconhecimento. Reconhecimento não é automático, não é natural. Tem que haver espaço explícito para que as pessoas reconheçam o bom trabalho umas das outras e demonstrem a sua apreciação. Por isso, nós praticamos toda semana. É singelo, mas faz toda a diferença. Os resultados de uma empresa são importantes. Mas, para mim, o jeito como você faz a empresa é tão importante quanto. Nós distinguimos um jeito de trabalhar do qual eu tenho muito orgulho. E esse jeito vai nos entregar resultados extraordinários. Afinal, são pessoas extraordinárias comprometidas com um futuro extraordinário. Time deco, quero reconhecer nossa resiliência e nossa TRANSFORMAÇÃO nos últimos três meses. Vocês me dão muito orgulho, toda semana eu tenho certeza que estou na sala certa!!! cc Luciano Júnior Rafael Crespo 💚",
    "title": "Week End Meeting: Announcements, Cleanups, Milestones & Recognition",
    "excerpt": "A weekly Friday meeting at deco.cx where we share announcements, discuss power drains, celebrate milestones, and recognize teammates, fostering a resilient and high‑performing culture.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-06-20",
    "interactionCount": 99
  },
  {
    "id": "7343100165454462976",
    "slug": "7343100165454462976",
    "content": "Problema: os modelos de AI não sabem coisas muito básicas sem você informar, tipo, que dia é hoje! Quando você quer fazer um agente de IA que filtra datas relativas, por exemplo, ele precisa saber a data e hora atuais. Hoje lançamos esse delicioso primeiro Prompt Dinâmico na nossa Prompt Library: o “now”, que inclui a data e hora atual UTC no momento da execução. Coisas tão simples mas que, fazendo agentes de IA no dia a dia, você sente falta. Olha que irado! Praise Marcos Candeia que soltou essa que tava na minha wishlist!!! Vou me esforçar pra compartilhar com vocês cada feature legal que a gente lança! Vai ser difícil porque tem muitas toda semana, mas vou conseguir!",
    "title": "Dynamic Prompt \"now\" Adds Real-Time UTC Timestamp",
    "excerpt": "Launch of the first dynamic prompt that injects the current UTC date and time into AI workflows.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-06-24",
    "interactionCount": 86
  },
  {
    "id": "7354249066018390022",
    "slug": "7354249066018390022",
    "content": "Que maravilha nosso novo README! Estamos fazendo o SDK open-source pra acelerar massivamente o mercado de agentes de AI no Brasil e no mundo - o que vai gerar muita renda para muita gente. Todo mundo pode pegar nosso código, hostear seus agentic workflows no Cloudflare com escala infinita, e ganhar dinheiro aplicando AI em processos na vida real. Se você quer apoiar uma plataforma open-source BRASILEIRA a dar certo, compartilha com os seus amigos devs, techs, PMs e designers, pra nos darem uma ⭐ estrela no GitHub! github.com/deco-cx/chat Também estamos montando um curso de Agentic Engineer, se você quiser participar, só se inscrever no deco.camp!",
    "title": "Introducing Our Open-Source SDK for AI Agents",
    "excerpt": "Announcing a new open-source SDK that accelerates AI agent development on Cloudflare, enabling developers to monetize AI workflows.",
    "authorName": "Guilherme Rodrigues",
    "authorEmail": "",
    "publishedDate": "2025-07-24",
    "interactionCount": 109
  }
]